let arr = [1, 2, 3, 4, 5];

// push() 메소드 : 배열에 값을 추가
// arr.push(6);
// push하면 배열 가장 뒤에 값이 들어감

// splice() : 배열의 요소를 삭제 또는 교체
// arr.splice(2, 1);
// 2번 방에서 시작하여 1개의 값 삭제(인덱스 x에서 n개를 삭제)
// 방 번호 재 정렬해줌
// [1, 2, 4, 5, 6]

// arr.splice(4, 1);
// [1, 2, 3, 4]

// arr.splice(2, 0, 10); 
// [1, 2, 10, 3, 4, 5]
// 인덱스 2에서 0개 삭제하고 10 삽입

// arr.splice(2, 1, 10);
// [1, 2, 10, 4, 5]
// 인덱스 2에서 1개 삭제하고 10 삽입

// arr.splice(2, 1, 'aaa');
// [1, 2, 'aaa', 4, 5]

// arr.splice(2, 0, 10, 11, 12, 13);
// [1, 2, 10, 11, 12, 13, 3, 4, 5]
// 인덱스 2에서 0개 삭제하고 10, 11, 12, 13 삽입
// 세번째 아규먼트부터는 가변파라미터로써 모든 값 추가

// indexOf() : 배열에서 특정 요소를 찾는데 사용
// arr.indexOf(4);
// 3 / 4가 인덱스 3에 위치

// lastIndexOf() : 배열에서 특정 요소 중 가장 마지막에 위치한 요소를 찾는데 사용
arr = [1, 1, 1, 3, 4, 5, 6, 6, 6, 10];
// arr.lastIndexOf(6);
// 8 / 인덱스 8이 6 마지막 위치






