<?php
// for문
// for(시작; 조건; 증가/증감 연산자) {
// 반복하고 싶은 처리
// }

// for($i = 0; $i <= 2; $i++) {
//     echo "안녕하세요.","\n";
// }
// i가 한번 실행 0
// i가 두번 실행 1
// i가 세번 실행 2
// 안녕하세요.
// 안녕하세요.
// 안녕하세요.

// break : for문을 종료하고 빠져나오는 문법
// for($i = 0; $i <= 2; $i++) {
//     echo "안녕하세요.","\n";
//     break;
// }
// break 에코 위에 있으면 한번도 실행 안되고 바로 빠져나옴
// break 에코 아래에 있으면 안녕하세요 에코 한번만 실행

// continue : continue 아래에 있는 처리를 실행하지 않고 다음 루프로 진행
// for($i = 0; $i <= 2; $i++) {
//     if($i === 1){
//         continue;
//     }
//     echo "안녕하세요.{$i}","\n";
// }
// $1 1일 때 continue로 포문 바로 돌아가고 다음루프로 진행
// 안녕하세요.0
// 안녕하세요.2

// 이중 루프 
for($i = 0; $i <= 1; $i++) {
    for($z = 9; $z >= 8; $z--) {
        echo "{$i},,,,,{$z}\n";
    }
}

for($i = 1; $i <= 1; $i++) {
    echo "상위 I\n";
    for($z = 0; $z <= 2; $z++) {
        echo "하위 Z";
    }
}



?>