<?php

// echo "tt";

// php 데이터 타입
//$num = 1;
//$str = "asd"; // 문자열은 항상 "" 감싸줘야함
//$arr = [1, 2, 3, 4]; // 배열표현 시 대괄호[]
//$boo = true; // 참,거짓 /
//$double = 2.34; 
// 변수 설정을 할 때에는 데이터 타입 신경써야함

// 연산자

// 1++;
// 1--;

// $num = 1;

// echo $num++;
// 후위연산자 1, 전위연산자 2 /

// 산술 대입 연산자
// $num = 1;
// $num = $num + 2; // 3 오른쪽 계산값이 왼쪽으로 저장
// $num += 2; // 3 

// 비교 연산자
//1 === "1"; // 결과 false
//1 == "1"; // 결과 true

// 논리 연산자
// && || !
// if(!(1 === 1)) {
//     echo "참";
// }


// () : 조건
// {} : 처리하고 싶은 연산
// [] : 배열 생성
// ; : 최소연산단위

// if( $조건 ) {
//     처리할 내용
// }

// for( $시작값; $종료조건; $루프마다얼마증가) {
//     처리할 내용
// }

// while( $조건 ) {
//     처리할 내용
// }

// if문 이용 : 90이면 수, 80이면 우, 그 외는 노력
// 조건을 넣을 때에는 비교연산자 넣기
// $score = 90;
// if( $score === 90 ) {
//     echo "수";
// } else if ( $score === 80 ) {
//     echo "우";
// } else {
//     echo "노력";
// }

//구구단 7단
// $a = 1;
// while($a <= 9) {
//     $mul = $a * 7;
//     echo "7 X {$a} = {$mul}\n";
//     $a++;
// }

// while(true) {
//     $mul = $a * 7;
//     echo "7 X {$a} = {$mul}\n";
//     $a++;
//     if($num === 10) {
//         break;
//     }
// }

// 배열(Array) : 키 값은 문자열로 적어줘야함 ex) "key1"
$arr = [1, 2, 3];
$arr2 = [
    "key1" => "val1"
    ,"key2" => [
        "key3" => "val3"
        ,"key4" => "val4"
    ]
];

echo $arr [2], "\n";
echo $arr2 ["key2"]["key4"];
// 3
// val4

foreach( $arr2["key2"] as $val) {
    echo $val, "\n";
}
// val3
// val4

print_r($arr2["key2"]);
// Array
// (
//     [key3] => val3
//     [key4] => val4
// )








