<?php
// 반복문을 이용해서 1~10까지 숫자 출력
// for($i = 1; $i <= 10; $i++) {
//     echo $i,"\n";
// }

// 구구단 2단을 반복문을 이용해서 작성
// for($i = 1; $i <= 9; $i++) {
//     $mul = $i * 2;
//     echo "2 X {$i} = {$mul}\n";
// }    

// 구구단 1~9단을 반복문을 이용해서 작성
// for($a = 1; $a <= 9; $a++) {
//         echo "{$a}단\n";
//     for($b = 1; $b <= 9; $b++) {
//         $c = $a * $b;
//         echo "$a X $b = $c\n";
//     }
// }

// 2~8단까지 출력 안되게 
for($a = 1; $a <= 9; $a++) {
    if($a % 2 === 1){
        continue;
    }
    echo "{$a}단\n";
    for($b = 1; $b <= 9; $b++) {
        $c = $a * $b;
        echo "$a X $b = $c\n";
    }
}

?>